cask_args appdir: "/Applications"

# Taps.
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Brews.
brew "awscli"
brew "elixir"
brew "git"
brew "mas"
brew "memcached"
brew "m-cli"
brew "node"
brew "heroku"
brew "postgresql", restart_service: true
brew "rbenv"
brew "redis"
brew "wget"
brew "yarn"
brew "youtube-dl"

# Casks.
cask "java"
cask "eclipse-java"
cask "atom"
cask "audio-hijack"
cask "dropbox"
cask "github-desktop"
cask "google-chrome"
cask "microsoft-office"
cask "polymail"
cask "sketch"
cask "skype"
cask "slack"
cask "whatsapp"

# Fonts.
cask "font-aleo"
cask "font-bitter"
cask "font-hack"
cask "font-inconsolata"
cask "font-lato"
cask "font-lobster"
cask "font-montserrat"
cask "font-nunito"
cask "font-open-sans"
cask "font-pacifico"
cask "font-roboto"
cask "font-roboto-slab"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store apps.
mas "Capo",          id: 696_977_615
mas "Fantastical 2", id: 975_937_182
mas "Slack",         id: 803_453_959
mas "Things3",       id: 904_280_696
mas "Logic Pro X",   id: 634_148_309
