cask_args appdir: "/Applications"

# Taps.
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Brews.
brew "git"
brew "mas"
brew "m-cli"
brew "heroku"
brew "postgresql", restart_service: true
brew "rbenv"
brew "redis"
brew "wget"

# Casks.
cask "java"
cask "eclipse-java"
cask "atom"
cask "audio-hijack"
cask "dropbox"
cask "github-desktop"
cask "google-chrome"
cask "microsoft-office"
cask "nylas-mail"
cask "skype"
cask "whatsapp"

# Mac App Store apps.
mas "Capo", id: 696977615
mas "Fantastical 2", id: 975937182
mas "Sketch", id: 852320343
mas "Slack", id: 803453959
